{"table":{"relation":[["","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25"],["Name","Un-Break My Heart","You\u0027re Makin\u0027 Me High","He Wasn\u0027t Man Enough","Breathe Again","Another Sad Love Song","You Mean the World to Me","He Wasn\u0027t Man Enough","Hurt You","I Love Me Some Him","Where Did We Go Wrong?","Seven Whole Days","Roller Coaster","Love Shoulda Brought You Home","You\u0027re Makin\u0027 Me High","Just Be a Man About It","Yesterday (feat. Trey Songz) [Bonus Track]","I Love Me Some Him","You\u0027re Makin\u0027 Me High","Just Be a Man About It","How Could an Angel Break My Heart","Un-Break My Heart","You Mean the World to Me","Breathe Again","I Wish","Just Be a Man About It"],["Album","Ultimate Toni Braxton","The Essential Toni Braxton","The Essential Toni Braxton","Toni Braxton","Toni Braxton","Toni Braxton","The Heat","Love, Marriage‎ \u0026 Divorce","Ultimate Toni Braxton","Love, Marriage‎ \u0026 Divorce","Toni Braxton","Love, Marriage‎ \u0026 Divorce","Toni Braxton","Ultimate Toni Braxton","The Essential Toni Braxton","Pulse (Deluxe)","Secrets","Secrets","The Heat","Secrets","Secrets","Ultimate Toni Braxton","The Essential Toni Braxton","Love, Marriage‎ \u0026 Divorce","Ultimate Toni Braxton"],["Time","4:28","4:27","4:22","4:29","5:01","4:56","4:21","4:10","4:36","3:37","6:20","4:23","4:58","4:06","4:49","3:46","5:06","4:27","4:48","4:20","4:30","3:59","4:29","3:03","4:16"],["Price","$1.29","$0.99","$0.99","$0.99","$1.29","$0.99","$0.99","$1.29","$0.99","$1.29","$0.99","$1.29","$0.99","$1.29","$0.99","$1.29","$0.99","$0.99","$0.99","$0.99","$1.29","$0.99","$0.99","$1.29","$0.99"],["","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes"]],"pageTitle":"iTunes - Music - Toni Braxton","title":"","url":"https://itunes.apple.com/us/artist/toni-braxton/id15935","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00032-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":865716391,"recordOffset":865689780,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{36692\u003dToward the end of 1997, Braxton filed a lawsuit against LaFace Records, attempting to gain release from a contract she felt was no longer fair or commensurate with her status. When LaFace countersued, Braxton filed for bankruptcy, a move that shocked many fans (who wondered how that could be possible, given her massive sales figures) but actually afforded her protection from further legal action. Braxton spent most of 1998 in legal limbo, and passed the time by signing on to portray Belle in the Broadway production of Disney\u0027s Beauty and the Beast (a role originally held by erstwhile teen queen Deborah Gibson). Braxton and LaFace finally reached a settlement in early 1999, and the singer soon began work on her third album. The Heat was released in the spring of 2000, and entered the charts at number two, matching the highest position held by Secrets. Lead single \"He Wasn\u0027t Man Enough\" was a Top Ten hit (and an R\u0026B chart-topper), although the follow-ups \"Just Be a Man About It\" (a duet with Dr. Dre) and \"Spanish Guitar\" didn\u0027t sustain the album\u0027s momentum as well as one might have expected. A brisk seller out of the box, The Heat eventually cooled off around the two-million mark, a disappointing showing compared to her previous efforts, despite yet another Grammy win for Best Female R\u0026B Vocal (\"He Wasn\u0027t Man Enough\")., 37946\u003dTo tide fans over until her next album was released, Braxton contributed \"Let It Flow\" to the Whitney Houston-centered soundtrack of Waiting to Exhale in 1995. Again working heavily with L.A. Reid and Babyface, Braxton released her second album, Secrets, in the summer of 1996, and predictably, it was another enormous hit. The first single, \"You\u0027re Makin\u0027 Me High,\" was Braxton\u0027s most overtly sexual yet, and it became her biggest pop hit to date; however, its success was soon eclipsed by the follow-up single, the Diane Warren-penned ballad \"Un-break My Heart.\" \"Un-break My Heart\" was an inescapable juggernaut, spending an amazing 11 weeks on top of the pop charts (and even longer on the adult contemporary charts). Further singles \"I Don\u0027t Want To\" and \"How Could an Angel Break My Heart\" weren\u0027t quite as successful (not that that\u0027s an indictment), but that didn\u0027t really matter; by then Secrets was well on its way to becoming Braxton\u0027s second straight eight-million seller. In 1997, she picked up Grammy awards for Best Female Pop Vocal and Best Female R\u0026B Vocal (for \"Un-break My Heart\" and \"You\u0027re Makin\u0027 Me High,\" respectively)., 35277\u003dBraxton appeared in the VH1 movie Play\u0027d in early 2002, and recorded More Than a Woman for release later that year. The singles \"Please\" and \"That\u0027s the Way Love Works (Trippin\u0027)\" announced Braxton\u0027s 2005 return with the full-length Libra, her first and only album recorded for the Blackground label. Initially a commercial disappointment, the album was re-released a year later when \"The Time of Our Lives\" — a collaboration with the vocal group Il Divo — became the official 2006 FIFA World Cup anthem. That same year the singer replaced Wayne Newton as the main performer at the Flamingo Hotel \u0026 Casino in Las Vegas. Her show, Toni Braxton: Revealed, would run until April of 2008 when she joined the cast of the competitive reality show Dancing with the Stars. After lasting five weeks before being voted off the show, Braxton announced she would be signing with the Atlantic label., 40730\u003dBraxton was born in Severn, Maryland, on October 7, 1968. The daughter of a minister, she was raised mostly in the strict Apostolic faith, which prohibited not only all popular culture, but also pants in women\u0027s wardrobes. Encouraged by their mother, an operatically trained vocalist, Braxton and her four sisters began singing in church as girls; although gospel was the only music permitted in the household, the girls often watched Soul Train when their parents went shopping. Braxton\u0027s parents later converted to a different faith, and eased their restrictions on secular music somewhat, allowing Braxton more leeway to develop her vocal style; because of her husky voice, she often used male singers like Luther Vandross, Stevie Wonder, and Michael McDonald as models, as well as Chaka Khan. Braxton had some success on the local talent show circuit, continuing to sing with her sisters, and after high school studied to become a music teacher. However, Braxton soon dropped out of college after she was discovered singing to herself at a gas station by songwriter Bill Pettaway (who co-authored Milli Vanilli\u0027s \"Girl You Know It\u0027s True\"). With Pettaway\u0027s help, Braxton and her sisters signed with Arista Records in 1990 as a group dubbed simply the Braxtons., 34328\u003dPulse was issued in 2010, cracked the Top Ten in the U.S., and was a respectable minor hit in several other countries. Braxton then further boosted her comeback profile by participating in another reality TV series, Braxton Family Values, which focused on her relationship with her mother and four sisters. In late 2013 she teamed up once again with Babyface to record the duets album Love, Marriage \u0026 Divorce. Motown released the album in February 2014., 39427\u003dThe Braxtons released a single in 1990 called \"The Good Life,\" and while it wasn\u0027t a hit, it caught the attention of L.A. Reid and Babyface, the red-hot songwriting/production team who had just formed their own label, LaFace (which was associated with Arista). Braxton became the first female artist signed to LaFace in 1991, and the following year she was introduced to the listening public with a high-profile appearance on the soundtrack of Eddie Murphy\u0027s Boomerang. Not only did her solo cut \"Love Shoulda Brought You Home\" become a substantial pop and R\u0026B hit, but she also duetted with Babyface himself on \"Give U My Heart.\" Anticipation for Braxton\u0027s first album ran high, and when her eponymous solo debut was released in 1993, it was an across-the-board smash, climbing to number one on both the pop and R\u0026B charts. It spun off hit after hit, including three more Top Ten singles in \"Another Sad Love Song,\" \"Breathe Again,\" and \"You Mean the World to Me,\" plus the double-sided R\u0026B hit \"I Belong to You\"/\"How Many Ways.\" With eventual sales of over eight million copies, Toni Braxton\u0027s run of popularity lasted well into 1995. By that time, Braxton had scored Grammys for Best New Artist and Best Female R\u0026B Vocal (\"Another Sad Love Song\") in 1994, and tacked on another win in the latter category for \"Breathe Again\" in 1995.}","textBeforeTable":"Top Songs 2 1 View In iTunes Discover More: Toni Braxton - EP 20. View In iTunes Make My Heart (DJ Spen \u0026 the MuthaFunkaz Mixes) 19. View In iTunes Discover Beyond: Toni Braxton - EP 18.","textAfterTable":"1 2 3 4 5 6 7 8 9 10 Next Top Music Videos 1. Yesterday (feat. Trey Songz) View In iTunes 2. Un-Break My Heart View In iTunes 3.","hasKeyColumn":true,"keyColumnIndex":1,"headerRowIndex":0},"mapping":{"URI":"https://itunes.apple.com/us/artist/toni-braxton/id15935","tableName":"1438042981460.12_20150728002301-00032-ip-10-236-191-2_865689780_0.json","numHeaderRows":1,"mappedClass":{"first":"http://dbpedia.org/ontology/Single","second":1.0},"mappedProperties":{"2":{"first":"http://dbpedia.org/ontology/album","second":0.060683096365046096}},"mappedInstances":{"1":{"first":"http://dbpedia.org/resource/Un-Break_My_Heart","second":0.8484309304619231},"2":{"first":"http://dbpedia.org/resource/You\u0027re_Makin\u0027_Me_High","second":0.8470624628035415},"4":{"first":"http://dbpedia.org/resource/Breathe_Again","second":0.9362491521865062},"20":{"first":"http://dbpedia.org/resource/How_Could_an_Angel_Break_My_Heart","second":0.8537428024226539},"5":{"first":"http://dbpedia.org/resource/Another_Sad_Love_Song","second":0.9486317428221002},"6":{"first":"http://dbpedia.org/resource/You_Mean_the_World_to_Me","second":0.9928552808063642},"7":{"first":"http://dbpedia.org/resource/He_Wasn\u0027t_Man_Enough","second":0.9131792374735046},"24":{"first":"http://dbpedia.org/resource/Wish_I","second":0.7934266972860216},"9":{"first":"http://dbpedia.org/resource/I_Love_Me_Some_Him","second":0.8484309304619231},"10":{"first":"http://dbpedia.org/resource/Where_Did_We_Go_Wrong_(BlackGirl_song)","second":0.7438963347436458},"11":{"first":"http://dbpedia.org/resource/Seven_Whole_Days","second":0.9362491521865062},"13":{"first":"http://dbpedia.org/resource/Love_Shoulda_Brought_You_Home","second":0.875933047049874},"15":{"first":"http://dbpedia.org/resource/Just_Be_a_Man_About_It","second":0.8566491657037493}},"keyIndex":1,"dataTypes":{"0":"numeric","1":"string","2":"string","3":"numeric","4":"numeric","5":"string"}}}